{
    "__meta__": {
        "lang_name": "English",
        "lang_name_native": "English",
        "aliases": [
            "en",
            "eng",
            "english"
        ],
        "yes": [
            "yes",
            "y",
            "true",
            "on"
        ],
        "no": [
            "no",
            "n",
            "false",
            "off"
        ]
    },
    "anastellos": {
        "info": {
            "about": {
                "desc": "[Bot description]\n\n> *Use `{prefix}help` to get the information about most commands.*",
                "indev": "\n\nThe bot is running in DEBUG mode and its stable operation is not guaranteered. It is recommended to refrain from using the bot until the maintainance is finished.",
                "anastellos": "Powered by Anastellos Engine",
                "creator": "<> with ❤ by {creator}"
            },
            "help": {
                "title": "Available commands",
                "title_groups": "Command groups",
                "desc": "*`[argument=X]` is an optional argument (empty defaults to X).*\n*`<argument>` requires the explicit input.*",
                "desc_groups": "*Use `{prefix}help <group name>` to see the subcommands.*",
                "usage": "**Command usage:**",
                "description": "**Description:**",
                "extra": "**Extra:**",
                "commands": {
                    "help": {
                        "desc": "Print this message."
                    },
                    "privacy": {
                        "desc": "Show the Privacy Policy document.",
                        "args": {
                            "lang": "language"
                        }
                    },
                    "about": {
                        "desc": "Print the info about the bot."
                    },
                    "ping": {
                        "desc": "Return latency time between the server and the bot."
                    },
                    "settings": {
                        "desc": "Print the current local server configuration. Only admins are allowed to use this group and subcommands."
                    },
                    "prefix": {
                        "desc": "Change the bot prefix for this server. Empty argument resets the setting to `{def_prefix}`.",
                        "args": {
                            "new_prefix": "new prefix"
                        }
                    },
                    "language": {
                        "desc": "Change the bot language for this server.",
                        "extra": "Available languages: `{lang_names}`.",
                        "args": {
                            "new_lang": "new language"
                        }
                    },
                    "leave": {
                        "desc": "Properly remove the bot from your server with or without wiping the config. Only admins are allowed to use this command."
                    }
                }
            }
        },
        "technical": {
            "stop": "*Stopping the bot...*",
            "reload": {
                "start": "*Modules reinitializing started...*",
                "error": "*An exception occurred while loading {i} module.*{traceback}",
                "success": "*Reinitializing complete.*"
            },
            "indev_notif": "\n> **WARNING! The bot is operating in DEBUG mode. Please refrain from using this mode if there are no tests running.**",
            "host_info": {
                "title": "Host info",
                "memory": "{used} of {total} GB ({used_percent}%)",
                "day": "day",
                "days": "days",
                "os": "Operating system",
                "mem": "RAM usage",
                "python_ver": "Python interpreter version",
                "nextcord_ver": "Nextcord library version",
                "bot_uptime": "Bot uptime",
                "bot_repo": "Bot build info",
                "engine_repo": "Engine build info",
                "branch": "Current branch",
                "commit_sha": "Revision hash"
            }
        },
        "settings": {
            "list": {
                "title": "Server preferences",
                "prefix": "Prefix",
                "lang": "Language",
                "enabled": "**enabled**",
                "disabled": "**disabled**",
                "multilevel": "*multi-level*",
                "toggle_cog": "Disable/enable cogs",
                "list": "*list*"
            },
            "prefix": {
                "title": "Prefix changed successfully",
                "desc": "New prefix: `{new_prefix}`."
            },
            "lang": {
                "title": "Bot language changed successfully",
                "desc": "The bot will speak English from now on."
            },
            "leave": {
                "title_msg": "{name} is preparing to leave...",
                "desc_msg": "Are you sure you want the bot to leave? Choose an option below.\n\nLeave - the bot will leave and remove only its webhooks and deassign log channel.\nLeave and forget - will also remove every trail of the server from the bot databases.\nCancel - keep the bot.",
                "ui": {
                    "leave": {
                        "label": "Leave",
                        "title": "{name} left the server. Goodbye!",
                        "desc": "We hope you enjoyed using our bot! Just in case you change your mind, we kept your configuration, so we can continue working just like before when you decide to let us come back."
                    },
                    "purge": {
                        "label": "Leave and forget",
                        "title": "{name} left and wiped data",
                        "desc": "We hope you enjoyed using our bot! All data about your server was wiped from our servers, so you can stay calm and not worry about your privacy. In case if you change your mind about us leaving, you still can get the bot working again, although it may be required to reconfigure it."
                    },
                    "cancel": {
                        "label": "Cancel",
                        "title": "Leaving cancelled",
                        "desc": "The bot is staying on the server. We won't disappoint you."
                    }
                }
            },
            "toggle_cog": {
                "title": "Cog status",
                "nocog_error": "There is no cog with such name.",
                "intcog_error": "This cog is essential for the bot and cannot be disabled.",
                "status_desc": "\"{cog_name}\" cog is currently {status} on this server.",
                "enable_desc": "\"{cog_name}\" cog has been enabled.",
                "disable_desc": "\"{cog_name}\" cog has been disabled."
            }
        },
        "global_errors": {
            "max_concurrency": "*The maximum amount of command instances is being processed right now.*",
            "channel_not_found": "*It seems there is no such channel in this server.*",
            "bad_argument": "*Bad arguments provided.*",
            "insufficient_perms": "*Insufficient permissions.*",
            "bot_insufficient_perms": "*The bot doesn't have enough permissions to complete this action.*",
            "guild_admins_only": "*You don't have enough permissions to use this command.*",
            "missing_required_argument": "*You have missed a required argument. Check the command usage syntax.*",
            "command_not_found": "*The specified command not found.*",
            "forbidden": "*Something won't let me do this, sorry.*",
            "not_owner": "*Only bot owner is allowed to do that.*",
            "no_history_access": "*The bot cannot access the message history and therefore unable to complete this action.*",
            "l10n_unsupported": "*This command is not supported by the current language.*"
        },
        "privacy": {
            "privacy": {
                "title": "Anastellos Engine Example Privacy Policy",
                "desc": "> __THIS IS A PLACEHOLDER VERSION OF PRIVACY POLICY, MAKE YOUR CHANGES BEFORE USING IT__\n\nThis document (\"Privacy Policy\") only applies to the instance of Bot Name hosted by the bot account `<@your_bot_id>` (\"Bot\"). The use of the Bot in a server (guild) requires the processing and/or storing of some specific user data (\"Data\").\n*To use the Bot, you are required to agree to the terms of Privacy Policy. If you decline them, the Bot will leave the server automatically.*\n\n**Processing of Data:**\nThe Bot may log the guild ID and its name as soon as it is invited to a server.\nThe Bot may log IDs and usernames of the users who typed any valid commands into any channel, accessible by the Bot, sent a direct message to the Bot, or directly mentioned the Bot in any channel.\nThe Bot processes and/or caches almost all the accessible Data including but not limited to: message IDs, message content, message attachments, member IDs, member usernames, member server nicknames, member avatar URLs, member custom statuses with the purpose of operating properly, although it cannot be accessed by the developer directly.\n\n**Storing of Data:**\nThe Bot saves all logged Data to a text file for the purpose of diagnostics.\nThe Bot does not store personal user Data until the person managing an account grants permission to do so for reasons including but not limited to: attribution for help in developing/translating the Bot.\nAfter a member with the permission to Manage Server accepts the terms of Privacy Policy, the Bot writes the guild ID into the local database to store the server configuration. It also stores Data including but not limited to: text, integer or boolean values for remembering the guild preferences, such as prefix, language, technical channel IDs, etc.\n\n**Access to Data:**\nThe mentioned Data is stored on a personal computer of the Bot developer. Only they are able to access and/or modify the Data at any given time.\n\n**Removal of Data:**\nThe Bot is able to delete the server preferences alongside with its ID from the database by using the option \"Leave and forget\", provided by using the command `ae!leave`.\nIn case if you want to remove all your user information (considering you gave your permission to store it before), you can request the removal manually by contacting the Bot developer in the direct messages or in the support server.\n\n> The developer reserves the right to modify this document at any given time, with or without noticing the users.",
                "footer": "Developer: {creator} | Last updated:",
                "timestamp": 1663184011,
                "_url": "https://example.com/",
                "agree": "Agree",
                "decline": "Decline"
            }
        }
    },
    "cmds": {}
}